## Name :- VANSH KOLTE
## Roll No : 62
## Practical 1 - Machine Learning

In [1]:
import pandas as pd

# Replace 'titanic.csv' with the path to your dataset file
df = pd.read_csv('titanic.csv')

# Perform basic EDA
print("First five rows of the dataset:")
df.head()

First five rows of the dataset:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
#print("Last five rows of the dataset:")
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [3]:
# print("Descriptive statistics:")
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
# print("Shape of the dataset:")
df.shape

(891, 12)

In [5]:
# Identify & handle missing values
print("Missing values in each column:")
df.isnull().sum()

Missing values in each column:

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
# Handling missing values (example: fill missing Age with median, drop Cabin)
df['Age'].fillna(df['Age'].median(), inplace=True)
df.drop(columns='Cabin', inplace=True)
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

# Verify no missing values left
print("Missing values after handling:")
df.isnull().sum()

Missing values after handling:

C:\Users\ASUS\AppData\Local\Temp\ipykernel_23112\1013133450.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)
C:\Users\ASUS\AppData\Local\Temp\ipykernel_23112\1013133450.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [32]:
# Check for duplicates and handle them
print("Number of duplicate rows:")
print(df.duplicated().sum())

# Removing duplicates
df.drop_duplicates(inplace=True)

print("Shape of the dataset after removing duplicates:")
print(df.shape)

Number of duplicate rows:
0
Shape of the dataset after removing duplicates:
(891, 11)

In [5]:
# Identify outliers & handle them
import matplotlib.pyplot as plt
import seaborn as sns

# Plotting boxplots for numerical features to identify outliers
numerical_features = ['Age', 'Fare']
for feature in numerical_features:
    plt.figure(figsize=(10, 6))
    sns.boxplot(x=df[feature])
    plt.title(f'Boxplot of {feature}')
    plt.show()

# Handling outliers (example: capping the Fare at 99th percentile)
fare_cap = df['Fare'].quantile(0.99)
df['Fare'] = df['Fare'].apply(lambda x: fare_cap if x > fare_cap else x)

NameError: name 'df' is not defined

In [15]:
# Apply data encoding techniques
# Encoding 'Sex' and 'Embarked' columns
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

# Check if 'Embarked' column exists and then apply get_dummies
if 'Embarked' in df.columns:
    df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)
else:
    print("Column 'Embarked' does not exist in the dataframe.")

# Verify the encoding
print("Data after encoding:")
df.head()

Column 'Embarked' does not exist in the dataframe.
Data after encoding:

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",NaN,-0.565736,1,0,A/5 21171,-0.564109,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,0.663861,1,0,PC 17599,0.942548,False,False
2,3,1,3,"Heikkinen, Miss. Laina",NaN,-0.258337,0,0,STON/O2. 3101282,-0.548227,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,0.433312,1,0,113803,0.514708,False,True
4,5,0,3,"Allen, Mr. William Henry",NaN,0.433312,0,0,373450,-0.545285,False,True

In [4]:
# Perform univariate, bivariate & multivariate analysis
# Univariate analysis
df['Age'].hist(bins=20)
plt.title('Histogram of Age')
plt.xlabel('Age')
plt.ylabel('Frequency')
plt.show()

# Bivariate analysis
sns.scatterplot(x='Age', y='Fare', hue='Survived', data=df)
plt.title('Scatter plot of Age vs Fare')
plt.show()

# Multivariate analysis
sns.pairplot(df[['Age', 'Fare', 'Survived']], hue='Survived')
plt.title('Pairplot of Age, Fare, and Survived')
plt.show()

NameError: name 'df' is not defined

In [17]:
# Apply feature scaling techniques
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])

In [18]:
# Split the dataset into training and testing sets
from sklearn.model_selection import train_test_split

X = df.drop(columns='Survived')
y = df['Survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

print("Shape of X_train:", X_train.shape)
print("Shape of X_test:", X_test.shape)
print("Shape of y_train:", y_train.shape)
print("Shape of y_test:", y_test.shape)

Shape of X_train: (712, 11)
Shape of X_test: (179, 11)
Shape of y_train: (712,)
Shape of y_test: (179,)